{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "10"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu1_gamma", 
      "attr": {"act_type": "prelu"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu1", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "16"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu2_gamma", 
      "attr": {"act_type": "prelu"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu2", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bias", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu3_gamma", 
      "attr": {"act_type": "prelu"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu3", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_1_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "2"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_1_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "2"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_1", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "2"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "outside_weights", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_weight", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_2_bias", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "4"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_2", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "4"
      }, 
      "inputs": [[16, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten1", 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bbox_targets", 
      "inputs": []
    }, 
    {
      "op": "_sub", 
      "name": "_minus0", 
      "inputs": [[27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul0", 
      "inputs": [[23, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square0", 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum0", 
      "attr": {"axis": "1"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "bbox_loss", 
      "attr": {
        "grad_scale": "0", 
        "normalization": "valid"
      }, 
      "inputs": [[32, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    7, 
    8, 
    10, 
    12, 
    13, 
    15, 
    17, 
    18, 
    21, 
    23, 
    24, 
    25, 
    28
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34
  ], 
  "heads": [[22, 0, 0], [33, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 901]}
}