{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu1_gamma", 
      "attr": {"act_type": "prelu"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu1", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu2_gamma", 
      "attr": {"act_type": "prelu"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu2", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bias", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu3_gamma", 
      "attr": {"act_type": "prelu"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu3", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_weight", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(2, 2)", 
        "num_filter": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_bias", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(2, 2)", 
        "num_filter": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(2, 2)", 
        "num_filter": "256"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu4_gamma", 
      "attr": {"act_type": "prelu"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu4", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_weight", 
      "attr": {"num_hidden": "16"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_bias", 
      "attr": {"num_hidden": "16"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "conv5", 
      "attr": {"num_hidden": "16"}, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu5_gamma", 
      "attr": {"act_type": "prelu"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu5", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_1_weight", 
      "attr": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_1_bias", 
      "attr": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "conv6_1", 
      "attr": {"num_hidden": "1"}, 
      "inputs": [[29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "yaw_label", 
      "inputs": []
    }, 
    {
      "op": "_sub", 
      "name": "_minus0", 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square0", 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum0", 
      "attr": {"axis": "1"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "loss1", 
      "attr": {
        "grad_scale": "0.0", 
        "normalization": "valid"
      }, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_2_weight", 
      "attr": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_2_bias", 
      "attr": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "conv6_2", 
      "attr": {"num_hidden": "1"}, 
      "inputs": [[29, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "pitch_label", 
      "inputs": []
    }, 
    {
      "op": "_sub", 
      "name": "_minus1", 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square1", 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum1", 
      "attr": {"axis": "1"}, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "loss2", 
      "attr": {
        "grad_scale": "0.0", 
        "normalization": "valid"
      }, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_3_weight", 
      "attr": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_3_bias", 
      "attr": {"num_hidden": "1"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "conv6_3", 
      "attr": {"num_hidden": "1"}, 
      "inputs": [[29, 0, 0], [46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "roll_label", 
      "inputs": []
    }, 
    {
      "op": "_sub", 
      "name": "_minus2", 
      "inputs": [[48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "square", 
      "name": "square2", 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum2", 
      "attr": {"axis": "1"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "MakeLoss", 
      "name": "loss3", 
      "attr": {
        "grad_scale": "10.0", 
        "normalization": "valid"
      }, 
      "inputs": [[52, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    7, 
    8, 
    10, 
    13, 
    14, 
    16, 
    19, 
    20, 
    22, 
    25, 
    26, 
    28, 
    30, 
    31, 
    33, 
    38, 
    39, 
    41, 
    46, 
    47, 
    49
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54
  ], 
  "heads": [[37, 0, 0], [45, 0, 0], [53, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 901]}
}