{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "64"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_mean", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm0_moving_var", 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm0", 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "prelu1_gamma", 
      "attr": {"act_type": "prelu"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu1", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_mean", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm1_moving_var", 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm1", 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 1], [18, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "prelu2_gamma", 
      "attr": {"act_type": "prelu"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu2", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bias", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "num_filter": "128"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_mean", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm2_moving_var", 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm2", 
      "inputs": [[25, 0, 0], [26, 0, 0], [27, 0, 0], [28, 0, 1], [29, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "prelu3_gamma", 
      "attr": {"act_type": "prelu"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu3", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool3", 
      "attr": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_weight", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(2, 2)", 
        "num_filter": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_bias", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(2, 2)", 
        "num_filter": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4", 
      "attr": {
        "dilate": "(1, 1)", 
        "kernel": "(2, 2)", 
        "num_filter": "256"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_mean", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batchnorm3_moving_var", 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "batchnorm3", 
      "inputs": [[36, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 1], [40, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "prelu4_gamma", 
      "attr": {"act_type": "prelu"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu4", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[41, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_weight", 
      "attr": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_bias", 
      "attr": {"num_hidden": "256"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "conv5", 
      "attr": {"num_hidden": "256"}, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "prelu5_gamma", 
      "attr": {"act_type": "prelu"}, 
      "inputs": []
    }, 
    {
      "op": "LeakyReLU", 
      "name": "prelu5", 
      "attr": {"act_type": "prelu"}, 
      "inputs": [[47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1", 
      "attr": {"p": "0.5"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_1_weight", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_1_bias", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "conv6_1", 
      "attr": {"num_hidden": "2"}, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "gender_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax1", 
      "inputs": [[53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_2_weight", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_2_bias", 
      "attr": {"num_hidden": "2"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "conv6_2", 
      "attr": {"num_hidden": "2"}, 
      "inputs": [[50, 0, 0], [56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "attractive_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax2", 
      "inputs": [[58, 0, 0], [59, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    4, 
    5, 
    6, 
    7, 
    9, 
    12, 
    13, 
    15, 
    16, 
    17, 
    18, 
    20, 
    23, 
    24, 
    26, 
    27, 
    28, 
    29, 
    31, 
    34, 
    35, 
    37, 
    38, 
    39, 
    40, 
    42, 
    45, 
    46, 
    48, 
    51, 
    52, 
    54, 
    56, 
    57, 
    59
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70
  ], 
  "heads": [[55, 0, 0], [60, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 901]}
}